//ตฺศýีย13ฬโ

#include <iostream>

using namespace std;

int main()
{
	int i;
	cin >> i;
	
	if (i <= 100000)
	{
		cout << i * 0.1;
	}
	if (i > 100000 && i <= 200000)
	{
		cout << 10000 + (i - 100000) * 0.075; 
	}
	if (i > 200000 && i <= 400000)
	{
		cout << 17500 + (i - 200000) * 0.05; 
	}
	if (i > 400000 && i <= 600000)
	{
		cout << 27500 + (i - 400000) * 0.03; 
	}
	if (i > 600000 && i <= 1000000)
	{
		cout << 33500 + (i - 600000) * 0.015; 
	}
	if (i >= 1000000)
	{
		cout << 39500 + (i - 600000) * 0.01;
	}
	
	return 0;
} 
